<template lang="pug">
  .rules
    main-header

    .content-container
      .content
        .content__title
          h1 Команды и 
            span правила
        .content__subtitle 
          h2 Правила сервера (Последнее обновление: 3 января 2020 года.)

        .rules__content.content-data
          p.
            <span class="subtitle">1. Основная информация:</span><br>
            <br>
            - Играя на наших серверах, Вы должны ознакомиться с правилами.<br>
            - Незнание правил не освобождает от наказания.<br>
            - Правила могут дополняться или изменяться в будущем, а в заголовке всегда будет дата последнего обновления.<br>
            - Модераторы сервера сами выбирают наказание для игрока в зависимости от нарушения и ситуации. Вы можете получить предупреждение, временный бан или вечный бан.<br>
            - Вы несёте ответственность за все свои аккаунты. Получив бан на старом аккаунте, Вы получите его и на новом.<br>
            - Это относится как к нашим серверным банам, так и к EAC/VAC банам.<br>
            Правила чата<br>
            - Запрещено предлагать сделать действия, приводящие к нежеланному выходу с сервера.<br>
            - К таким действиям относится нажатие alt+f4, прописывание disconnect в консоль и прочие подобные действия, о значении которых другие игроки могут не знать.<br>
            - Запрещена любая клевета, дезинформация или ложь про игроков, администрацию и сервер.<br>
            - Запрещено выдавать себя за администратора, модератора или любого ютубера, если Вы на самом деле им не являетесь.<br>
            <br>
            <span class="subtitle">2. Игровой процесс:</span><br>
            <br>
            - Запрещено использовать/хранить/распространять стороннее программное обеспечение или любые другие средства (например читы или макросы), позволяющие получить преимущество над другими игроками.<br>
            - Наличие покупки/подписки приравнивается к хранению.<br>
            - Запрещено использование багов игры/сервера с целью или без цели получения преимущества над другими игроками.<br>
            - Запрещено превышать лимит игроков в команде, если имеется (указан в названии сервера, например [2 Play]).<br>
            - Запрещено строиться или хранить лут в камнях, скалах или под фундаментами.<br>
            - Запрещено загружать на таблички изображения, содержащие материалы оскорбительного и порнографического характера.<br>
            - Запрещено строить большие "усы" и "юбки" от домов. При мелких нарушениях всё лишнее будет удаляться без предупреждения, а при серьёзных Вы получите бан и полное удаление всего дома.<br>
            - Не запрещено повышать яркость монитора с целью лучшей видимости в ночное время.<br>
            - Не запрещено обманывать игроков при обмене.<br>
            <br>
            <span class="subtitle">3. Игроки:</span><br>
            <br>
            - Запрещено использовать нецензурные слова или оскорбления в нике.<br>
            - Запрещено использовать рекламу серверов/сайтов/проектов в нике.<br>
            - Запрещено использование слов "ADMIN" или "MODER" в нике в любом возможном виде.<br>
            - Запрещено надоедать другим игрокам (постоянно отправлять запросы на телепортацию, дружбу, обмен).<br>
            - Если Вам отказали один раз, не надо повторять запросы снова.<br>
            - Запрещено использовать чужие ник и аватарку, выдавая себя за другого игрока.<br>
            <br>
            <span class="subtitle">4. Дополнительная информация:</span><br>
            <br>
            Если Вас подозревают в читерстве и вызывают на проверку ПК, Вы имеете полное право отказаться от этого, но в этом случае мы будем вынуждены забанить Вас на всех серверах.<br>
            Если Вы не читер и хотите продолжить играть у нас на серверах, согласитесь на проверку и выполните действия, которые Вам будет говорить модератор.<br>
            Мы не будем сохранять или передавать любую информацию, не связанную с растом и читами, которую получим от Вас.<br>
            Проверка ПК на наличие читов проводится только в тот момент, когда Вас на неё вызвали, при этом Вы обязаны оставаться на сервере. Если Вы покинули сервер, не предоставили контакты для связи или просите проверить Вас уже после бана, Вам будет отказано и Вы останетесь забанены.<br>
            Проверка осуществляется с помощью RustCheatCheck, скачать который вы можете на официальном сайте: https://rustcheatcheck.ru/.<br>
            Вы также имеете полное право отказаться от скачивания, но в этом случае мы будем вынуждены забанить Вас на всех серверах.<br>
            Администраторы и модераторы имеют право забанить игрока без предупреждения и объяснения, если у них имеются доказательства читерства или нарушения правил.<br>
            Администраторы и модераторы имеют право забанить напарников читера, если они знали о наличии нечистой силы у своего товарища.<br>
            Администраторы или модераторы не возвращают утерянный лут.<br>
            Администраторы и модераторы имеют право забанить игрока, если он распространяет информацию о модераторах/администраторах, не доступную публично (сливы).<br>
            Вещи и услуги, купленные в магазине, не подлежат возврату, обмену или переносу.<br>
            Мы не компенсируем любые сбои в услугах, которые предоставляются бесплатно (например магические карточки).<br>
            Попытка обмана администрации или модерации сервера с целью или без цели получения выгоды карается бессрочным баном в группе сервера и на всех серверах.<br>

          .content__subtitle 
            h2 Команды сервера

          p.
            <span class="subtitle"><b>Список биндов, необходимых для удобной игры:</b></span><br>
            <br>
            <span class="bold">bind u building.upgrade</span> - Выбор типа автоматического улучшения строений.<br>
            <span class="bold">bind p remove</span> - Включение/Выключение режима удаления.<br>
            <span class="bold">bind k kit.menu</span> - Открыть/закрыть меню наборов.<br>
            <span class="bold">bind j tp.menu</span> - Открыть/закрыть меню телепортации.<br>
            <br>
            <span class="subtitle"><b>Список платных биндов, необходимых для удобной игры:</b></span><br>
            <br>
            <span class="bold">bind b backpack.open</span> - Открыть рюкзак.<br>
            <span class="bold">bind f2 rec</span> - Открыть окно переработчика. Не обязательно указывать те кнопки, что приведены в списке выше. На каждую команду можете назначить любую удобную для Вас кнопку.<br>
            <br>
            <span class="subtitle"><b>Список команд, связанных с телепортацией:</b></span><br>
            <br>
            <span class="bold">/tpr</span> - игрок Отправить запрос на телепортацию к игроку.<br>
            <span class="bold">/tpa</span> - Принять запрос на телепортацию.<br>
            <span class="bold">/tpc</span> - Отменить/отклонить телепортацию.<br>
            <span class="bold">/sethome</span> - название Сохранить местоположение дома.<br>
            <span class="bold">/removehome</span> - название удалить дом с указанным названием.<br>
            <span class="bold">/home list</span> - Показать список Ваших домов.<br>
            <span class="bold">/home название</span> - Телепортироваться на дом с указанным названием.<br>
            <br>
            <span class="subtitle"><b>Список команд для друзей и кланов:</b></span><br>
            <br>
            <span class="bold">/friend add</span> - игрок Отправить игроку запрос на дружбу.<br>
            <span class="bold">/friend remove</span> - игрок Удалить друга.<br>
            <span class="bold">/friend accept</span> - Принять запрос дружбы.<br>
            <span class="bold">/friend deny</span> - Отклонить запрос дружбы.<br>
            <span class="bold">/friends или /friend list</span> - Показать список друзей.<br>
            <br>
            <span class="subtitle"><b>Прочие команды:</b></span><br>
            <br>
            <span class="bold">/kit</span> - Показать меню наборов.<br>
            <span class="bold">/kits</span> - Показать в чате список наборов.<br>
            <span class="bold">/kit кит</span> - Получить набор с указанным названием.<br>
            <span class="bold">/report</span> - сообщение Отправить сообщение всем модераторам сервера.<br>
            <span class="bold">/prefix</span> - Смена префикса перед ником.<br>
            <br>
            <span class="subtitle"><b>Список платных команд:</b></span><br>
            <br>
            <span class="bold">/skin</span> - Открыто окно выбора скинов.<br>
            <span class="bold">/sil</span> - ссылка на картинку Поставить картинку из интернета на табличку.<br>
            <span class="bold">/color</span> - Сменить цвет ника.<br>
            <span class="bold">/rec</span> - Открыть окно переработчика.<br>

    main-footer
</template>

<script>
import MainHeader from '../components/Header';
import MainFooter from '../components/Footer';

export default {
  name: 'Rules',
  components: {
    MainHeader,
    MainFooter
  },
  data() {
    return {
      
    }
  },

  created() {
  }
}
</script>

<style lang="stylus" scoped>
.content-container
  margin-top 105px
  padding-bottom 60px
</style>