<template lang="pug">
  .rules
    main-header

    .content-container
      .content
        .content__title
          h1 Команды и 
            span правила
        .content__subtitle 
          h2 Правила сервера (Последнее обновление: 1 ноября 2020 года.)

        .rules__content.content-data
          p.
            <span class="subtitle">1. Общие положения:</span><br>
            <br>
            - Данные правила являются обязательными для ознакомления. Незнание правил не освобождает от ответственности.<br>
            - Администраторы/Модераторы проекта сами определяют наказание за нарушение данных правил пользователями.<br>
            - Ответственность за аккаунт и весь контент несёт исключительно владелец аккаунта.<br>
            - Запрещена публикация заведомо ложной информации, которая способна ввести игроков в заблуждение,<br> 
            особенно касательно обстановки на сервере, планов и иной политики, проводимой администрацией.<br>
            - Запрещается призывать пользователей к нарушению правил проекта.<br>
            - Данные правила могут быть изменены и дополнены.<br>
            <br>
            <span class="subtitle">2. Основное:</span><br>
            <br>
            - Запрещино распространять читы/макросы.<br>
            - Запрещино использовать ники ADMIN/MODER, а так же выдавать себя за Администратора/Модера проекта.<br>
            - Запрещено использовать или хранить читы/макросы.<br>
            - Запрещается игра с играками которые используют читы/макросы.<br>
            - Запрещается любой багаюз в игре.<br>
            <br>
            <span class="subtitle">3. Игровой чат:</span><br>
            <br>
            - Запрещено употребление нецензурных выражений. Как в открытой, так и в завуалированной форме.<br>
            - Запрещены оскорбления пользователей, модераторов, проекта.<br>
            - Запрещено злоупотребление клавишей Caps Lock.<br>
            - Запрещен флуд<br>
            - Запрещён троллинг в любых его проявлениях.<br>
            <br>
            <span class="subtitle">4. Дополнительная информация:</span><br>
            <br>
            - Вы вправе отказатся от проверки на использования читов/макросов, но в этом случае вы получите блокировку.<br>
            - Выход с сервера или не предоставили контакты для связи при проверке, автоматически выдается блокировка.<br>
            - Просьбы о проверке после блокировки, будут отказаны.<br>
            - Проверки проходят только через програму DISCORD<br>
            - Администраторы и модераторы имеют право забанить игрока без предупреждения и объяснения, если у них имеются доказательства.<br>
            - Вещи и услуги, купленные в магазине, не подлежат возврату или обмену.<br>

          .content__subtitle 
            h2 Команды сервера

          p.
            <span class="subtitle"><b>Список биндов, необходимых для удобной игры:</b></span><br>
            <br>
            <span class="bold">bind p remove</span> - Включение/Выключение режима удаления.<br>
            <span class="bold">bind k kit.menu</span> - Открыть/закрыть меню наборов.<br>
            <br>
            <span class="subtitle"><b>Список команд</b></span><br>
            <br>
            <span class="bold">/tpr</span> - игрок Отправить запрос на телепортацию к игроку.<br>
            <span class="bold">/tpa</span> - Принять запрос на телепортацию.<br>
            <span class="bold">/tpc</span> - Отменить/отклонить телепортацию.<br>
            <span class="bold">/sethome</span> - название Сохранить местоположение дома.<br>
            <span class="bold">/removehome</span> - название удалить дом с указанным названием.<br>
            <span class="bold">/home list</span> - Показать список Ваших домов.<br>
            <span class="bold">/home название</span> - Телепортироваться на дом с указанным названием.<br>
            <span class="bold">/kit</span> - Показать меню наборов.<br>
            <span class="bold">/report</span> - сообщение Отправить сообщение всем модераторам сервера.<br>
            <span class="bold">/store</span> - забрать купленые в магазине товары.<br>
            <span class="bold">/pm</span> - личное сообщени.<br>
            <span class="bold">/help</span> - помощь.<br>
            <br>
            <span class="subtitle"><b>Список команд для друзей и кланов:</b></span><br>
            <br>
            <span class="bold">/friend add</span> - игрок Отправить игроку запрос на дружбу.<br>
            <span class="bold">/friend remove</span> - игрок Удалить друга.<br>
            <span class="bold">/friend accept</span> - Принять запрос дружбы.<br>
            <span class="bold">/friend deny</span> - Отклонить запрос дружбы.<br>
            <span class="bold">/friends или /friend list</span> - Показать список друзей.<br>

    main-footer
</template>

<script>
import MainHeader from '../components/Header';
import MainFooter from '../components/Footer';

export default {
  name: 'Rules',
  components: {
    MainHeader,
    MainFooter
  },
  data() {
    return {
      
    }
  },

  created() {
  }
}
</script>

<style lang="stylus" scoped>
.content-container
  margin-top 105px
  padding-bottom 60px
</style>